from django.shortcuts import render
from django.shortcuts import get_object_or_404, get_list_or_404
from django.http import JsonResponse
from rest_framework import serializers
from rest_framework.decorators import api_view, permission_classes
from rest_framework.response import Response
from rest_framework.permissions import AllowAny
from rest_framework.response import Response
from .models import CafeList
from commercial_area.models import SeoulGuDong, CommercialArea
from .serializers import CafeListSerializer
from copy import deepcopy

# Create your views here.

word_grouping = {
    '브런치': [
        '경리단길브런치', '명동브런치카페', '방배동브런치', '브런치카페', '연남동브런치카페', '합정브런치', '호주브런치', '브런치뷔페''브런치'
    ],
    '키즈': [
        '키즈카페', '미술키즈카페', '양천구키즈카페', '예스키즈존', '베이킹키즈카페', '키즈카페맥주', '이유식카페', '어린이놀이방', '모래놀이터', '아기의자', '키즈클래스', '아이와함께', '신정3동키즈카페', '키즈', '실내놀이터'
    ],
    '반려동물': [
        '애견카페', '청량리애견카페', '비숑미용', '노원강아지카페', '애견수영장', '강북반려견카페', '애견수제간식', '애견동반카페', '애견동반가능', '야외애견카페', '애견호텔',
        '반려동물간식', '전농동애견페', '반려동물미용', '동대문애견카페', '애견훈련', '애견동반식당', '남산에견동반카페', '애견동반', '노원애견카페', '노원애견호텔', '애견유치원',
        '강아지유치원', '강아지동반카페', '구파발애견동반', '강아지용품', '노원강아지호텔', '반려견동반카페', '반려동물동반', '미니비숑미용'
    ],
    '오락': [
        '강남역보드카페', '보드카페클루', '공포방탈출', '보드게임대여', '방탈출추천', '보드카페', '샤로수길만화카페', '방탈출카페', '홍대방탈출추천', '보드게임카페', '만화카페', '건대보드게임', '건대방탈출', '홍대방탈출카페',
        '만화방', '강남보드카페', '상수방탈출', '보드게임방', '신촌보드카페', '홍대방탈출', '신촌보드게임', '경희대만화카페', '보드게임', '서울대입구만화', '은평구보드카페', '합정방탈출', '건대보드게임카페', '강남역보드게임', '회기동만화카페'
    ],
    '책': [
        '독립서점', '강북카페', '조용한카페', '창포원북카페비상', '창포원북카페', '책읽기좋은', ' 공부하기좋은', '책읽기좋은곳', '책맥', '강남북카페', '조용한', '서울북카페', '동네책방', '도서관풍', '북카페'
    ],
    '디저트': [
        '서초동수제디저트', '레어마카롱', '케이크맛집', '크리스마스케이크', '말렌카꿀케이크', '핸드메이드마카롱', '주문제작케이크', '마카롱맛집', '마카롱클래스', '은평구비건빵', '목동마카롱', '신림마카롱',
        '빙수', '동대문구마카롱', '얼그레이파운드', '크림치즈', '앙금플라워케이크', '떡케이크', '파르페', '바나나파운드케익', '파운드케이크', '수제쿠키', '수유케이크', '장안동마카롱', '바스크치즈케이크',
        '붕어빵', '스콘맛집', '테린느', '신대방마카롱', '마들렌맛집', '수제마카롱전문', '커스텀케이크제작', '뚱카롱', '레터링케이크', '스모어쿠키', '빈티지케이크''컵케이크', '종로에그타르트', '디져트맛집', '중랑구스콘',
        '와플맛집', '크로플', '유기농카스테라', '캐러멜', '비건빵', '티라미슈', '버클리쿠키', '진리티라미수', '서울떡케이크', '스콘', '에끌레어', '케익', '티라미수선물', '구움과자', '장한평마카롱', '아메리칸쿠키', '휘낭시에', '크레페카페',
        '디자인케이크', '당근케이크', '에그와플', '컵케익카페', '수제초콜릿', '에그타르트', '수제케이크', '미아사거리케이크', '푸딩', '피넛버터크리미', '휘낭시에맛집', '마카롱', '스콘쿠키', '월영구움과자', '달고나', '에그타르트맛집',
        '르뱅쿠키', '커피콩빵', '쿠키맛집', '케이크주문제작', '블랙롤', '수제그래놀라', '난곡마카롱', '비스킷', '당일케이크', '크로플맛집', '초콜릿체험', '마카롱케이크', '미아케이크', '쿠키', '르뱅', '티라미수',
        '달고나맛집', '수제마카롱', '서촌에그타르트', '수제타르트', '빙수맛집', '오류동마카롱', '아메리칸르뱅쿠키', '수제와플', '떡케이크주문제작', '팬케이크', '마들렌', '케이크', '키라임파이', '동대문마카롱', '와플카페', '캐릭터마카롱',
        '수제와플카페', '일본식디저트'
    ],
    '커피전문': [
        '안동대마라떼', '원두판매', '에스프레소그자체', '커피원두', '디카페인', '로스팅커피', 'Espresso', '핸드드립커피', '핸드드립', '로스터리카페', '커피숍', '핸드드립전문점', '로스팅카페', '원두납품', '정릉카페', 'cafe', '영국커피',
        '서울에스프레소바', '로스팅전문', '바닐라라떼', '쌍문동커피숍', '보스코카페', '로스터리', '시그니처커피', '아인슈패너', '아메리카노', '보스코', '성수동에스프레소', 'COFFEE', '로스팅', '숯불로스팅', '아인슈페너', '석계역원두', '아인슈페너맛집',
        '타이거커피', '카페', '잠실에스프레소', '커피오마카세', '레스토카페', '커피전문점', '디카페인커피', '커피', '호주식커피', '라떼맛집', '바닐라빈라떼', '아메리카노맛집', '필터커피', '핸드드립카페', 'coffee', '보스코에스프레소',
        '필터커피전문점', '소금커피', '에스프레소바', '에스프레소', ' 아몬드크림라떼', '더치커피', '석계역핸드드립', '콜드브루', '라떼비엔나맛집', '크림커피맛집', '커피맛집'
    ],
    '공부': [
        '스터디카페', '공부하기좋은', '스터디룸'
    ],
    '다방': [
        '다방'
    ],
    '테마': [
        '산소카페', '식물성음료', '스페셜티카페', '유럽풍카페', '프랑스가정식', '사주', '도봉동가성비까페', '분위좋은카페', '조향클래스', '힐링', '마사지', '미술전시', '침대카페', '강남펄맛집', '카페맛집', '소품샵', '떡카페', '서울식물원', '음악바',
        '길음뉴타운맛집', '까치산그릭요거트', '루프탑뷰', '구파발맛집', '필리핀음식', '고시촌데이트', '성수동카페거리', '떡케이크만들기체험', '마카롱클래스', '목동대만샌드위치', '남산서울타워', '드레스체험가능', '은평구비건빵', '건대이색카페',
        '앤틱한', '배도라지즙', '채광', '뮤직카페', '조용한카페', '정갈한느낌', '잠실데이트', '분위기좋은', '라이브공연', '건대맛집', '가성비좋은', '연남동신점', '야외테라스', '외국어카페', '핫도그카페', '멀티룸카페', '공릉역맛집', '흑당맛집',
        '실내낚시카페', '수제청', '용산맛집', '서경대맛집', '건강음료', '레트로풍', '마곡역맛집 ', '사진찍기좋은곳', '뉴트로카페', '터키요리', '테라스', '캘리그라피카페', '갤러리카페', '가족모임', '샌드위치', '성수동핫플',
        '사케라토맛집', '포토카페', '먹골카페', '은평구테라스카페', '스페인요리', '식물카페', '배도라지청', '요거트전문카페', '루프탑있는', '타로카페', '정감있는카페', '경복궁맛집', '폰케이스만들기', '신촌놀거리', '경춘선숲길', '북유럽인테리어',
        '합정데이트', '과일요거트', '고양이카페', '서울숲디저트', '분위기좋은곳', '라이브바', '바게트', '한옥스타일', '티카페', '무인매장', '석촌샐러드', '편집샵', '레트로카페', '포토존', '국민대맛집', '캠핑느낌나는',
        '다이닝카페', '유럽가정식', '애프터눈티', '노원구무인카페', '송리단길샐러드', '카야토스트', '기계마사지', '이색술집', '야외애견카페', '광진구맛집', '제로웨이스트', '드로잉카페', '그릭요거트', '경리단길브런치', '오믈렛', '요거트카페',
        '생과일전문점', '무인카페', '락카페', '실내데이트', '노펫존', '외부음식반입가능', '창고형카페', '친목모임', '수제청음료', '라운지카페', '메세지캔', '프렌치토스트', '서울숲카페', '노트북하기좋은', '강서구그릭요거트', '고급진', '연희동찻집',
        '이국적인', '핫플카페', '가산맛집', '데이트맛집', '달고나밀크티', '다트', '전통음식', '도라지청', '아늑한', '이태원맛집', '인스타감성', '이색데이트', '이태원핫플', '소개팅', '오피스카페', '전망맛집', '배달카페', '공장형분위기', '다락방카페',
        '여의도배달카페', '도예체험', '한옥개조', '경리단맛집', '공릉맛집', '이수맛집', '신용산맛집', '좌식카페', '건대데이트', '홍대사주', '그릭요거트맛집', '글루텐프리', '공간대여', '고즈넉한', '반지만들기체험', '보틀우유', '비건',
        '수제베이커리', '빈티지카페', '공방카페', '군자맛집', '석촌역맛집', '룸카페', '사주카페', '노을맛집', '족욕카페', '시리얼카페', '깔끔한', '꽃배달서비스', '커피클래스', '가성비', '강남맛집', 'LP바', '감성인테리어', '전시회',
        '프랑스음식', '건대드로잉카페', '힙지로', '이벤트카페', '경리단길카페', '건대데이트코스', '밀크티', '쿠킹클래스', '작명소', '수유맛집', '구디맛집', '컬쳐카페', '데이트코스', '모던한', '비건베이커리', '비스트로', '베이커리카페', '트램폴린카페',
        '샐러드카페', '숙대맛집', '경치좋은', '쌀베이킹', '오락실', '데이트하기좋은곳', '온실카페', '가구카페', '삼각지맛집', '점심식사', '건대룸카페', '마사지카페', '생일카페', '재즈카페', '24시간카페', '생일카페대관', '아기자기한', '일본가정식',
        '비트박스', '궁합', '아침식사', '개별룸', '건대루프탑카페', '미드센추리모던', '꽃집', '정릉맛집', '세제리필샵', '노원불빛정원', '한식뷔페', '디톡스음료', '샐러드', '안마의자카페', '루프탑카페', '합정맛집', '예술의전당맛집', '독일식요리',
        '베이킹클래스', '맛집', '모임장소', '상봉맛집', '경양식요리', '용리단길', '2001아울렛', '회의공간대여', '피규어카페', '아쿠아카페', '도라지가루', '티룸', '수제샌드위치', '홍대타로', '양재천카페거리', '홍대놀거리', '야외카페', '원데이클래스',
        '공릉동맛집', '양궁', '송리단길카페', '수제우유', '봉천동포토존', '편안한카페', '분위기좋은카페', '미니멀디자인', '무채색카페', '비트박스강일동점', '하계맛집', '로컬푸드', '유럽풍분위기', '테마카페', '감성카페', '뷰티카페', '베이글', '조용한',
        '야외테이블', '옷카페', '비건라떼', '교대맛집', '뮤지엄카페', '비건푸드', '24시', 'VR카페', '자전거테마카페', '봉천동루프탑', '멕시코요리', '자몽허니블랙티', '야외정원', '당산맛집', '수유역맛집', '테라스카페', '독일가정식', '프랑스디저트',
        '수면카페', '한옥카페', '바리스타교육', '스페셜티커피', '서울숲까페', '석촌역샐러드', '송리단길맛집', '강남밀크티맛집', '도라지정과', '청파동맛집', '수제청', '수공예품', '명리강의', '정릉동맛집', '굿즈샵',
        '명동맛집', '독산동맛집', '도자기카페', '신림예쁜카페', '앙금플라워', '연남동데이트', '에이드맛집', '심리상담카페', '누드브라운샵', '제로웨이스트샵', '전통차체험', '구관인형카페', '이색체험', '초콜릿체험', '밀크티맛집',
        '딸기뷔페', '홍차', '홍대신점', '아케이드카페', '슬라임카페', '재즈바', '셀프빨래방', '전망좋은', '부띠끄카페', '베트남풍', '타로점', '강남데이트', '교대역맛집', '신촌데이트', '이쁜카페', '노원맛집', '테라스가있는', '생일파티',
        '공주풍', '기념떡', '힐링카페', '도서관풍', '잠실맛집', '요거트볼', '라이브카페', '서촌데이트', '구파발역샐러드', '프라모델', '캐주얼한분위기', '라쿤카페', '노원그릭요거트', '답례떡', '로봇카페', '전통찻집', '영국식',
        '중곡동맛집', '타로', '구파발역샌드위치', '이색적인', 'DJ카페', '교대비스트로', '연남동사주', '석촌호수맛집', '수제음료', '베이커리', '성북구맛집', '압구정베이커리', '종암동맛집', '커피교육', '그릴드치즈', '익선동핫플', '당산커피맛집',
        '낭만적인', '떡케이크주문제작', '청포도에이드', '점심특선', '한복체험', '데이트장소', '드레스카페', '은평구맛집', '과일카페', '송리단길', '뮤직펍', '파티룸', '하계동무인카페', '이색카페', '브런치뷔페', '빈티지분위기',
        '전농동맛집', '배달', '노원디저트맛집', '비건카페', '용리단길카페', '건대파티룸', '목동무인카페', '강남놀거리', '플라워카페', '서울숲', '건대놀거리', '마곡나루맛집', '방토에이드'
    ],
    '카페Bar': [
        '삼각지술집', '이태원술집', '힙지로와인바', '양주', '군자역칵테일', '을지로와인바', '캐주얼펍''스탠딩바', '군자역위스키바', '명동와인', '이색술집', '수제맥주', '와인한잔하기좋은', '성수와인',
        '혼술', '하우스와인', '아메리칸펍', '은평구와인바', '위스키더치', '버맥', 'LP바', '가맥', '맥주', '군자동위스키바', '다이닝펍', '비어카페', '낮술하기좋은', '방배동와인', '피맥', '와인', '라운지펍',
        '칵테일바', '와인카페', '위스키', '캐주얼와인바', '내추럴와인', '와인전문', '세계맥주', '칵테일', '와인바', '경리단길와인바', '뮤직펍', '상봉와인바', '피자펍', '군자동칵테일바', '술한잔하기좋은'
    ]
}

# 카페 정보 요청


@api_view(['GET'])
@permission_classes([AllowAny])
def get_cafes(request, guName, dongName, tag):
    Dong = SeoulGuDong.objects.filter(guName=guName, dongName=dongName)
    cafes = CafeList.objects.filter(guName=guName, dongCode=Dong[0].dongCode)
    Data = []
    tmp_data = {
        'dongCode': '',
        'commercialCode': [],
        'guName': '',
        'UrlId': '',
        'cafeName': '',
        'cafeRate':  '',
        'reviewCount': '',
        'cafeAddress': '',
        'cafeHour': '',
        'cafeTel': '',
        'cafeHomepage': '',
        'cafeTag': [],
        'cafePhoto': '',
        'cafePoint': [],
        'cafeTagKeyword': [],
    }

    # print(word_grouping[tag])
    for cafe in cafes:
        tmp_tags = cafe.cafeTag.split()
        for tmp_t in tmp_tags:
            tmp_t = tmp_t.lstrip('#')
            for value in word_grouping[tag]:
                if value == tmp_t:
                    tmp_data['cafeTag'] = cafe.cafeTag

                    # 가공이 필요 없는 데이터들
                    tmp_data['dongCode'] = cafe.dongCode_id
                    tmp_data['guName'] = cafe.guName
                    tmp_data['UrlId'] = cafe.UrlId
                    tmp_data['cafeName'] = cafe.cafeName
                    tmp_data['cafeRate'] = cafe.cafeRate
                    tmp_data['reviewCount'] = cafe.reviewCount
                    tmp_data['cafeAddress'] = cafe.cafeAddress
                    tmp_data['cafeHour'] = cafe.cafeHour.split('&')
                    tmp_data['cafeTel'] = cafe.cafeTel
                    tmp_data['cafeHomepage'] = cafe.cafeHomepage
                    tmp_data['cafeTag'] = cafe.cafeTag.split()
                    tmp_data['cafePhoto'] = cafe.cafePhoto
                    tmp_data['cafePoint'] = list(
                        map(float, cafe.cafePoint.split('&')))

                    # 상권 데이터 역참조
                    tmp_cc = []
                    for c in cafe.commercialCode.all().values():
                        tmp_cc.append(c['commercialAreaCode'])
                    tmp_cc = list(set(tmp_cc))  # 중복제거
                    tmp_data['commercialCode'] = tmp_cc
        Data.append(deepcopy(tmp_data))
        data = []
        for d in Data:
            if d not in data:
                data.append(d)
    return JsonResponse(data, safe=False)


# 방법
# 1. tag가 넘어오면 딕녀서리의 key를 순회
# 2. tag에 해당하는 key의 values를 순회
# 3. 동에 있는 모든 카페의 태그를 순회하면서 values의 단어가 카페 태그에 존재하면 그 카페를 뽑는다.
# 4. 해당하는 모든 카페들을 프론트로 보내줌
